In [58]:
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np
#import sklearn.datasets as dta
#For correlation coefficient
#import scipy.stats as st

from sqlalchemy import create_engine
import psycopg2

from config import user, password

#engine = create_engine('postgresql+psycopg2://postgres:Purple77!@5432/EmployeeSQL')
#connection = engine.connect()


#https://stackoverflow.com/questions/9353822/connecting-postgresql-with-sqlalchemy
engine = create_engine(f'postgresql://{user}:{password}@localhost:5432/EmployeeSQL')
connection = engine.connect()

In [60]:
#https://pythontic.com/pandas/serialization/postgresql
dataFrame  = pd.read_sql("select * from \"departments\"", connection);
dataFrame

  dept_no           dept_name
0    d001           Marketing
1    d002             Finance
2    d003     Human Resources
3    d004          Production
4    d005         Development
5    d006  Quality Management
6    d007               Sales
7    d008            Research
8    d009    Customer Service

In [61]:
x  = pd.read_sql("select * from \"dept_emp\"", connection);
x

        emp_no dept_no
0        10001    d005
1        10002    d007
2        10003    d004
3        10004    d004
4        10005    d003
...        ...     ...
331598  499995    d004
331599  499996    d004
331600  499997    d005
331601  499998    d002
331602  499999    d004

[331603 rows x 2 columns]

In [ ]:
connection.close();